class SpellsForm:
    def __init__(self):
        self.classes = [
            'друїд',
            'паладин',
            'клірик',
            'бард',
            'рейнджер',
            'чаклун',
            'чарівник',
            'заклинач',
            'винахідник'
        ]
        self.levels = [
            'замовляння',
            '1 рівень',
            '2 рівень',
            '3 рівень',
            '4 рівень',
            '5 рівень',
            '6 рівень',
            '7 рівень',
            '8 рівень',
            '9 рівень',
        ]
        self.schools = [
            'Ілюзія',
            'Віщування',
            "З’явлення",
            'Перешкоджання',
            'Втілення',
            'Некромантія',
            'Зачарування',
            'Перетворення'
        ]
        self.casting_times = [
            '1 дія',
            '1 бонусна дія',
            '1 реакція',
            '1 хвилина',
            '10 хвилин',
            '1 година',
            '8 годин',
            '1 дія або 8 годин',
            '12 годин',
            '24 години'
        ]
        self.rituals = [
            'так',
            'ні'
        ]
        self.concentrations = [
            'так',
            'ні'
        ]
        self.sources = [
            'Книга гравця',
            'Ташин казан усього',
            'Занатарів довідник усього'
        ]
